In [22]:
import pandas as pd

In [23]:
# Get invalid entries in ID

df = pd.read_csv('Unclean_Data2.csv')

In [24]:
df

,ID,Name,Age,Gender,Email,Occupation,Salary,Have Children,Number of Children,City_State
0,1,John Smith,35,M,johnsmith@gmail.com,Engineer,"$90,000",Y,2,"New York, NY"
1,two,Jane Doe,28,F,janedoe@hotmail.com,Scientist,"$85,000",N,1,"San Francisco, CA"
2,3,Mark Brown,42,M,xx,Doctor,"$100,000",Y,3,"Boston, MA"
3,4,Mary Lee,a,F,marylee@invalid-email,Sales Manager,"$75,000",no,-1,"Chicago, IL"
4,5,David Chen,27,M,davidchen@gmail.com,Lawyer,"$95,000",yes,five,"Dallas, TX"
5,6,Janny Low,32,F,jennylow@hotmail.com,Programmer,"$80,000",NaN,0,"Miami, FL"
6,7,Carlos Lee,39,M,carloslee@gmail.com,Engineer,"$110,000",Y,1,"Phoenix, AZ"
7,8,Samantha,24,F,samantha@gmail.com,Doctor,80k,N,3,"Atlanta, GA"
8,9,Brian Kim,31,M,briankim@gmail.com,Teacher,"$70,000",yes,2,"Denver, CO"
9,10,John Dow,44,M,johndoe@gmail.com,Programmer,"$105,000",NaN,-1,"New York, NY"
10,x,Alice Wong,29,F,alicewong@yahoo.com,Engineer,"$85,000",Y,0,"San Francisco, CA"
11,12,Rose Lee,34,e,roselee@gmail.com,nnn,"$120,000",no,NaN,"Boston, MA"
12,13,NaN,38,F,rachelkim@hotmail.com,Accountant,"$90,000",YES,three,"Chicago, IL"
13,NaN,Michael Wu,27,M,michaelwu@gmail.com,Sales Manager,"$80,000",N,-2,"Dallas, TX"
14,15,???,b,F,anitali@yahoo.com,Teacher,"$65,000",yes,2,"Miami, FL"
15,16,William Tan,47,M,williamtan@gmail.com,Doctor,"$130,000",NO,2,"Phoenix, AZ"
16,17,Emily Tan,25,F,emilytan@gmail.com,Engineer,"$90,000",Y,1,"Atlanta, GA"
17,18,Chris Li,36,M,chrisli@hotmail.com,Programmer,"$95,000",N,0,"Denver, CO"
18,19,Sharon Gomez,42,F,yy,Teacher,"$100,000",y,two,"New York, NY"
19,20,Jackson Wu,33,M,jacksonwu@gmail.com,Scientist,"$95,000",NaN,NaN,"San Francisco, CA"

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  19 non-null     object
 1   Name                19 non-null     object
 2   Age                 20 non-null     object
 3   Gender              20 non-null     object
 4   Email               20 non-null     object
 5   Occupation          20 non-null     object
 6   Salary              20 non-null     object
 7   Have Children       17 non-null     object
 8   Number of Children  18 non-null     object
 9   City_State          20 non-null     object
dtypes: object(10)
memory usage: 1.7+ KB

In [26]:
df.ID.astype('str')

0       1
1     two
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10
10      x
11     12
12     13
13    nan
14     15
15     16
16     17
17     18
18     19
19     20
Name: ID, dtype: object

In [27]:
df['ID_isDigit'] = df.ID.str.isdigit()

In [28]:
df[['ID', 'ID_isDigit']]

     ID ID_isDigit
0     1       True
1   two      False
2     3       True
3     4       True
4     5       True
5     6       True
6     7       True
7     8       True
8     9       True
9    10       True
10    x      False
11   12       True
12   13       True
13  NaN        NaN
14   15       True
15   16       True
16   17       True
17   18       True
18   19       True
19   20       True

In [29]:
df[['ID']][df.ID_isDigit == False]

     ID
1   two
10    x

In [46]:
# Clean Name
df.Name.astype('str')

0       John Smith
1         Jane Doe
2       Mark Brown
3         Mary Lee
4       David Chen
5        Janny Low
6       Carlos Lee
7         Samantha
8        Brian Kim
9         John Dow
10      Alice Wong
11        Rose Lee
12             nan
13      Michael Wu
14             ???
15     William Tan
16       Emily Tan
17        Chris Li
18    Sharon Gomez
19      Jackson Wu
Name: Name, dtype: object

In [49]:
df.Name.info()

<class 'pandas.core.series.Series'>
RangeIndex: 20 entries, 0 to 19
Series name: Name
Non-Null Count  Dtype
--------------  -----
19 non-null     object
dtypes: object(1)
memory usage: 292.0+ bytes

In [64]:
def in_alphabet(x):
    x = str(x)
    for i in range(len(x)):
        if x[i] in 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ':
            return x
        else:
            return None

df['Name_clean'] = df.Name.apply(in_alphabet)

In [65]:
df

,ID,Name,Age,Gender,Email,Occupation,Salary,Have Children,Number of Children,City_State,ID_isDigit,Name_clean
0,1,John Smith,35,M,johnsmith@gmail.com,Engineer,"$90,000",Y,2,"New York, NY",True,John Smith
1,two,Jane Doe,28,F,janedoe@hotmail.com,Scientist,"$85,000",N,1,"San Francisco, CA",False,Jane Doe
2,3,Mark Brown,42,M,xx,Doctor,"$100,000",Y,3,"Boston, MA",True,Mark Brown
3,4,Mary Lee,a,F,marylee@invalid-email,Sales Manager,"$75,000",no,-1,"Chicago, IL",True,Mary Lee
4,5,David Chen,27,M,davidchen@gmail.com,Lawyer,"$95,000",yes,five,"Dallas, TX",True,David Chen
5,6,Janny Low,32,F,jennylow@hotmail.com,Programmer,"$80,000",NaN,0,"Miami, FL",True,Janny Low
6,7,Carlos Lee,39,M,carloslee@gmail.com,Engineer,"$110,000",Y,1,"Phoenix, AZ",True,Carlos Lee
7,8,Samantha,24,F,samantha@gmail.com,Doctor,80k,N,3,"Atlanta, GA",True,Samantha
8,9,Brian Kim,31,M,briankim@gmail.com,Teacher,"$70,000",yes,2,"Denver, CO",True,Brian Kim
9,10,John Dow,44,M,johndoe@gmail.com,Programmer,"$105,000",NaN,-1,"New York, NY",True,John Dow
10,x,Alice Wong,29,F,alicewong@yahoo.com,Engineer,"$85,000",Y,0,"San Francisco, CA",False,Alice Wong
11,12,Rose Lee,34,e,roselee@gmail.com,nnn,"$120,000",no,NaN,"Boston, MA",True,Rose Lee
12,13,NaN,38,F,rachelkim@hotmail.com,Accountant,"$90,000",YES,three,"Chicago, IL",True,nan
13,NaN,Michael Wu,27,M,michaelwu@gmail.com,Sales Manager,"$80,000",N,-2,"Dallas, TX",NaN,Michael Wu
14,15,???,b,F,anitali@yahoo.com,Teacher,"$65,000",yes,2,"Miami, FL",True,None
15,16,William Tan,47,M,williamtan@gmail.com,Doctor,"$130,000",NO,2,"Phoenix, AZ",True,William Tan
16,17,Emily Tan,25,F,emilytan@gmail.com,Engineer,"$90,000",Y,1,"Atlanta, GA",True,Emily Tan
17,18,Chris Li,36,M,chrisli@hotmail.com,Programmer,"$95,000",N,0,"Denver, CO",True,Chris Li
18,19,Sharon Gomez,42,F,yy,Teacher,"$100,000",y,two,"New York, NY",True,Sharon Gomez
19,20,Jackson Wu,33,M,jacksonwu@gmail.com,Scientist,"$95,000",NaN,NaN,"San Francisco, CA",True,Jackson Wu

In [66]:
# Clean age

In [68]:
df['Age_clean'] = pd.to_numeric(df.Age, errors='coerce')

In [69]:
df[['Age', 'Age_clean']]

   Age  Age_clean
0   35       35.0
1   28       28.0
2   42       42.0
3    a        NaN
4   27       27.0
5   32       32.0
6   39       39.0
7   24       24.0
8   31       31.0
9   44       44.0
10  29       29.0
11  34       34.0
12  38       38.0
13  27       27.0
14   b        NaN
15  47       47.0
16  25       25.0
17  36       36.0
18  42       42.0
19  33       33.0

In [70]:
# Clean Gender

In [71]:
df['Gender_clean'] = df.Gender.apply(lambda x: x if x == 'F' or x == 'M' else None)

In [72]:
df[['Gender', 'Gender_clean']]

   Gender Gender_clean
0       M            M
1       F            F
2       M            M
3       F            F
4       M            M
5       F            F
6       M            M
7       F            F
8       M            M
9       M            M
10      F            F
11      e         None
12      F            F
13      M            M
14      F            F
15      M            M
16      F            F
17      M            M
18      F            F
19      M            M

In [73]:
# Clean Email

In [81]:
df.Email.is_unique

True

In [86]:
df.Email.astype('str')

0       johnsmith@gmail.com
1       janedoe@hotmail.com
2                        xx
3     marylee@invalid-email
4       davidchen@gmail.com
5      jennylow@hotmail.com
6       carloslee@gmail.com
7        samantha@gmail.com
8        briankim@gmail.com
9         johndoe@gmail.com
10      alicewong@yahoo.com
11        roselee@gmail.com
12    rachelkim@hotmail.com
13      michaelwu@gmail.com
14        anitali@yahoo.com
15     williamtan@gmail.com
16       emilytan@gmail.com
17      chrisli@hotmail.com
18                       yy
19      jacksonwu@gmail.com
Name: Email, dtype: object

In [131]:
def valid_email(x):
    x = str(x)
    if x.endswith('.com') and x.__contains__('@'):
        return x
    else:
        return None


df['Email_clean'] = df.Email.apply(valid_email)

In [132]:
df[['Email', 'Email_clean']]

                    Email            Email_clean
0     johnsmith@gmail.com    johnsmith@gmail.com
1     janedoe@hotmail.com    janedoe@hotmail.com
2                      xx                   None
3   marylee@invalid-email                   None
4     davidchen@gmail.com    davidchen@gmail.com
5    jennylow@hotmail.com   jennylow@hotmail.com
6     carloslee@gmail.com    carloslee@gmail.com
7      samantha@gmail.com     samantha@gmail.com
8      briankim@gmail.com     briankim@gmail.com
9       johndoe@gmail.com      johndoe@gmail.com
10    alicewong@yahoo.com    alicewong@yahoo.com
11      roselee@gmail.com      roselee@gmail.com
12  rachelkim@hotmail.com  rachelkim@hotmail.com
13    michaelwu@gmail.com    michaelwu@gmail.com
14      anitali@yahoo.com      anitali@yahoo.com
15   williamtan@gmail.com   williamtan@gmail.com
16     emilytan@gmail.com     emilytan@gmail.com
17    chrisli@hotmail.com    chrisli@hotmail.com
18                     yy                   None
19    jacksonwu@gmail.com    jacksonwu@gmail.com

In [133]:
# Clean Occupation

In [134]:
df['Occupation']

0          Engineer
1         Scientist
2            Doctor
3     Sales Manager
4            Lawyer
5        Programmer
6          Engineer
7            Doctor
8           Teacher
9        Programmer
10         Engineer
11              nnn
12       Accountant
13    Sales Manager
14          Teacher
15           Doctor
16         Engineer
17       Programmer
18          Teacher
19        Scientist
Name: Occupation, dtype: object

In [144]:
occupation_list = ['Engineer',
                   'Scientist',
                   'Doctor',
                   'Sales Manager',
                   'Lawyer',
                   'Programmer',
                   'Teacher',
                   'Accountant']

In [145]:
occupation_list

['Engineer',
 'Scientist',
 'Doctor',
 'Sales Manager',
 'Lawyer',
 'Programmer',
 'Teacher',
 'Accountant']

In [146]:
df['Occupation_clean'] = df.Occupation.apply(lambda x: x if x in occupation_list else None)

In [147]:
df[['Occupation', 'Occupation_clean']]

       Occupation Occupation_clean
0        Engineer         Engineer
1       Scientist        Scientist
2          Doctor           Doctor
3   Sales Manager    Sales Manager
4          Lawyer           Lawyer
5      Programmer       Programmer
6        Engineer         Engineer
7          Doctor           Doctor
8         Teacher          Teacher
9      Programmer       Programmer
10       Engineer         Engineer
11            nnn             None
12     Accountant       Accountant
13  Sales Manager    Sales Manager
14        Teacher          Teacher
15         Doctor           Doctor
16       Engineer         Engineer
17     Programmer       Programmer
18        Teacher          Teacher
19      Scientist        Scientist

In [148]:
# Clean Salary

In [175]:
def valid_salary(x):
    x = str(x)
    y = x.replace('$', '').lower().replace('k', '000').replace(',', '')
    return y

In [176]:
df['Salary_clean'] = df.Salary.apply(valid_salary)

In [177]:
df[['Salary', 'Salary_clean']]

      Salary Salary_clean
0    $90,000        90000
1    $85,000        85000
2   $100,000       100000
3    $75,000        75000
4    $95,000        95000
5    $80,000        80000
6   $110,000       110000
7        80k        80000
8    $70,000        70000
9   $105,000       105000
10   $85,000        85000
11  $120,000       120000
12   $90,000        90000
13   $80,000        80000
14   $65,000        65000
15  $130,000       130000
16   $90,000        90000
17   $95,000        95000
18  $100,000       100000
19   $95,000        95000

In [178]:
df.Salary_clean.astype('float64')

0      90000.0
1      85000.0
2     100000.0
3      75000.0
4      95000.0
5      80000.0
6     110000.0
7      80000.0
8      70000.0
9     105000.0
10     85000.0
11    120000.0
12     90000.0
13     80000.0
14     65000.0
15    130000.0
16     90000.0
17     95000.0
18    100000.0
19     95000.0
Name: Salary_clean, dtype: float64

In [235]:
# Check the columns Have Children and Number of Children using Inter-Field Checking

In [236]:
df['Have_Children_clean'] = df['Have Children'].str[0].str.lower()

In [237]:
df[['Have Children', 'Have_Children_clean']]

   Have Children Have_Children_clean
0              Y                   y
1              N                   n
2              Y                   y
3             no                   n
4            yes                   y
5            NaN                 NaN
6              Y                   y
7              N                   n
8            yes                   y
9            NaN                 NaN
10             Y                   y
11            no                   n
12           YES                   y
13             N                   n
14           yes                   y
15            NO                   n
16             Y                   y
17             N                   n
18             y                   y
19           NaN                 NaN

In [238]:
df['Number_of_Children_clean'] = pd.to_numeric(df['Number of Children'], errors='coerce')

In [239]:
df[['Number of Children', 'Number_of_Children_clean']]

   Number of Children  Number_of_Children_clean
0                   2                       2.0
1                   1                       1.0
2                   3                       3.0
3                  -1                      -1.0
4                five                       NaN
5                   0                       0.0
6                   1                       1.0
7                   3                       3.0
8                   2                       2.0
9                  -1                      -1.0
10                  0                       0.0
11                NaN                       NaN
12              three                       NaN
13                 -2                      -2.0
14                  2                       2.0
15                  2                       2.0
16                  1                       1.0
17                  0                       0.0
18                two                       NaN
19                NaN                       NaN

In [240]:
df['Number_of_Children_clean'] = df['Number_of_Children_clean'].apply(lambda x: x if x >= 0 else None)

In [241]:
df[['Number of Children', 'Number_of_Children_clean']]

   Number of Children  Number_of_Children_clean
0                   2                       2.0
1                   1                       1.0
2                   3                       3.0
3                  -1                       NaN
4                five                       NaN
5                   0                       0.0
6                   1                       1.0
7                   3                       3.0
8                   2                       2.0
9                  -1                       NaN
10                  0                       0.0
11                NaN                       NaN
12              three                       NaN
13                 -2                       NaN
14                  2                       2.0
15                  2                       2.0
16                  1                       1.0
17                  0                       0.0
18                two                       NaN
19                NaN                       NaN

In [242]:
df.Number_of_Children_clean.astype('str')

# def children_for_no(x):
#     if x == 0 and df.Have_Children_clean == 'n':
#         return x

0     2.0
1     1.0
2     3.0
3     nan
4     nan
5     0.0
6     1.0
7     3.0
8     2.0
9     nan
10    0.0
11    nan
12    nan
13    nan
14    2.0
15    2.0
16    1.0
17    0.0
18    nan
19    nan
Name: Number_of_Children_clean, dtype: object

In [244]:
df.Number_of_Children_clean.dtype

dtype('float64')

In [256]:
df.Have_Children_clean.astype('str')

0       y
1       n
2       y
3       n
4       y
5     nan
6       y
7       n
8       y
9     nan
10      y
11      n
12      y
13      n
14      y
15      n
16      y
17      n
18      y
19    nan
Name: Have_Children_clean, dtype: object

In [259]:
df.Have_Children_clean.dtype

dtype('O')

In [281]:
def check_num_of_children(row):
    check1 = row.Have_Children_clean=='n' and row.Number_of_Children_clean > 0
    check2 = row.Have_Children_clean=='y' and row.Number_of_Children_clean == 0
    if check1:
        return 0
    elif check2:
        return None
    else:
        return row.Number_of_Children_clean

In [282]:
df['children_cross_ok'] = df.apply(check_num_of_children, axis=1)

In [283]:
df

,ID,Name,Age,Gender,Email,Occupation,Salary,Have Children,Number of Children,City_State,ID_isDigit,Name_clean,Age_clean,Gender_clean,Email_clean,Occupation_clean,Salary_clean,Have_Children_clean,Number_of_Children_clean,children_cross_ok
0,1,John Smith,35,M,johnsmith@gmail.com,Engineer,"$90,000",Y,2,"New York, NY",True,John Smith,35.0,M,johnsmith@gmail.com,Engineer,90000,y,2.0,2.0
1,two,Jane Doe,28,F,janedoe@hotmail.com,Scientist,"$85,000",N,1,"San Francisco, CA",False,Jane Doe,28.0,F,janedoe@hotmail.com,Scientist,85000,n,1.0,0.0
2,3,Mark Brown,42,M,xx,Doctor,"$100,000",Y,3,"Boston, MA",True,Mark Brown,42.0,M,None,Doctor,100000,y,3.0,3.0
3,4,Mary Lee,a,F,marylee@invalid-email,Sales Manager,"$75,000",no,-1,"Chicago, IL",True,Mary Lee,NaN,F,None,Sales Manager,75000,n,NaN,NaN
4,5,David Chen,27,M,davidchen@gmail.com,Lawyer,"$95,000",yes,five,"Dallas, TX",True,David Chen,27.0,M,davidchen@gmail.com,Lawyer,95000,y,NaN,NaN
5,6,Janny Low,32,F,jennylow@hotmail.com,Programmer,"$80,000",NaN,0,"Miami, FL",True,Janny Low,32.0,F,jennylow@hotmail.com,Programmer,80000,NaN,0.0,0.0
6,7,Carlos Lee,39,M,carloslee@gmail.com,Engineer,"$110,000",Y,1,"Phoenix, AZ",True,Carlos Lee,39.0,M,carloslee@gmail.com,Engineer,110000,y,1.0,1.0
7,8,Samantha,24,F,samantha@gmail.com,Doctor,80k,N,3,"Atlanta, GA",True,Samantha,24.0,F,samantha@gmail.com,Doctor,80000,n,3.0,0.0
8,9,Brian Kim,31,M,briankim@gmail.com,Teacher,"$70,000",yes,2,"Denver, CO",True,Brian Kim,31.0,M,briankim@gmail.com,Teacher,70000,y,2.0,2.0
9,10,John Dow,44,M,johndoe@gmail.com,Programmer,"$105,000",NaN,-1,"New York, NY",True,John Dow,44.0,M,johndoe@gmail.com,Programmer,105000,NaN,NaN,NaN
10,x,Alice Wong,29,F,alicewong@yahoo.com,Engineer,"$85,000",Y,0,"San Francisco, CA",False,Alice Wong,29.0,F,alicewong@yahoo.com,Engineer,85000,y,0.0,NaN
11,12,Rose Lee,34,e,roselee@gmail.com,nnn,"$120,000",no,NaN,"Boston, MA",True,Rose Lee,34.0,None,roselee@gmail.com,None,120000,n,NaN,NaN
12,13,NaN,38,F,rachelkim@hotmail.com,Accountant,"$90,000",YES,three,"Chicago, IL",True,nan,38.0,F,rachelkim@hotmail.com,Accountant,90000,y,NaN,NaN
13,NaN,Michael Wu,27,M,michaelwu@gmail.com,Sales Manager,"$80,000",N,-2,"Dallas, TX",NaN,Michael Wu,27.0,M,michaelwu@gmail.com,Sales Manager,80000,n,NaN,NaN
14,15,???,b,F,anitali@yahoo.com,Teacher,"$65,000",yes,2,"Miami, FL",True,None,NaN,F,anitali@yahoo.com,Teacher,65000,y,2.0,2.0
15,16,William Tan,47,M,williamtan@gmail.com,Doctor,"$130,000",NO,2,"Phoenix, AZ",True,William Tan,47.0,M,williamtan@gmail.com,Doctor,130000,n,2.0,0.0
16,17,Emily Tan,25,F,emilytan@gmail.com,Engineer,"$90,000",Y,1,"Atlanta, GA",True,Emily Tan,25.0,F,emilytan@gmail.com,Engineer,90000,y,1.0,1.0
17,18,Chris Li,36,M,chrisli@hotmail.com,Programmer,"$95,000",N,0,"Denver, CO",True,Chris Li,36.0,M,chrisli@hotmail.com,Programmer,95000,n,0.0,0.0
18,19,Sharon Gomez,42,F,yy,Teacher,"$100,000",y,two,"New York, NY",True,Sharon Gomez,42.0,F,None,Teacher,100000,y,NaN,NaN
19,20,Jackson Wu,33,M,jacksonwu@gmail.com,Scientist,"$95,000",NaN,NaN,"San Francisco, CA",True,Jackson Wu,33.0,M,jacksonwu@gmail.com,Scientist,95000,NaN,NaN,NaN

In [279]:
df[df.children_cross_ok == 0]

,ID,Name,Age,Gender,Email,Occupation,Salary,Have Children,Number of Children,City_State,ID_isDigit,Name_clean,Age_clean,Gender_clean,Email_clean,Occupation_clean,Salary_clean,Have_Children_clean,Number_of_Children_clean,children_cross_ok
1,two,Jane Doe,28,F,janedoe@hotmail.com,Scientist,"$85,000",N,1,"San Francisco, CA",False,Jane Doe,28.0,F,janedoe@hotmail.com,Scientist,85000,n,1.0,0.0
5,6,Janny Low,32,F,jennylow@hotmail.com,Programmer,"$80,000",NaN,0,"Miami, FL",True,Janny Low,32.0,F,jennylow@hotmail.com,Programmer,80000,NaN,0.0,0.0
7,8,Samantha,24,F,samantha@gmail.com,Doctor,80k,N,3,"Atlanta, GA",True,Samantha,24.0,F,samantha@gmail.com,Doctor,80000,n,3.0,0.0
15,16,William Tan,47,M,williamtan@gmail.com,Doctor,"$130,000",NO,2,"Phoenix, AZ",True,William Tan,47.0,M,williamtan@gmail.com,Doctor,130000,n,2.0,0.0
17,18,Chris Li,36,M,chrisli@hotmail.com,Programmer,"$95,000",N,0,"Denver, CO",True,Chris Li,36.0,M,chrisli@hotmail.com,Programmer,95000,n,0.0,0.0

In [284]:
df[df.Have_Children_clean == 'y']

,ID,Name,Age,Gender,Email,Occupation,Salary,Have Children,Number of Children,City_State,ID_isDigit,Name_clean,Age_clean,Gender_clean,Email_clean,Occupation_clean,Salary_clean,Have_Children_clean,Number_of_Children_clean,children_cross_ok
0,1,John Smith,35,M,johnsmith@gmail.com,Engineer,"$90,000",Y,2,"New York, NY",True,John Smith,35.0,M,johnsmith@gmail.com,Engineer,90000,y,2.0,2.0
2,3,Mark Brown,42,M,xx,Doctor,"$100,000",Y,3,"Boston, MA",True,Mark Brown,42.0,M,None,Doctor,100000,y,3.0,3.0
4,5,David Chen,27,M,davidchen@gmail.com,Lawyer,"$95,000",yes,five,"Dallas, TX",True,David Chen,27.0,M,davidchen@gmail.com,Lawyer,95000,y,NaN,NaN
6,7,Carlos Lee,39,M,carloslee@gmail.com,Engineer,"$110,000",Y,1,"Phoenix, AZ",True,Carlos Lee,39.0,M,carloslee@gmail.com,Engineer,110000,y,1.0,1.0
8,9,Brian Kim,31,M,briankim@gmail.com,Teacher,"$70,000",yes,2,"Denver, CO",True,Brian Kim,31.0,M,briankim@gmail.com,Teacher,70000,y,2.0,2.0
10,x,Alice Wong,29,F,alicewong@yahoo.com,Engineer,"$85,000",Y,0,"San Francisco, CA",False,Alice Wong,29.0,F,alicewong@yahoo.com,Engineer,85000,y,0.0,NaN
12,13,NaN,38,F,rachelkim@hotmail.com,Accountant,"$90,000",YES,three,"Chicago, IL",True,nan,38.0,F,rachelkim@hotmail.com,Accountant,90000,y,NaN,NaN
14,15,???,b,F,anitali@yahoo.com,Teacher,"$65,000",yes,2,"Miami, FL",True,None,NaN,F,anitali@yahoo.com,Teacher,65000,y,2.0,2.0
16,17,Emily Tan,25,F,emilytan@gmail.com,Engineer,"$90,000",Y,1,"Atlanta, GA",True,Emily Tan,25.0,F,emilytan@gmail.com,Engineer,90000,y,1.0,1.0
18,19,Sharon Gomez,42,F,yy,Teacher,"$100,000",y,two,"New York, NY",True,Sharon Gomez,42.0,F,None,Teacher,100000,y,NaN,NaN